back-end/app/controllers/api_controller.rb

INSERT INTO "missions" ("title", "progress", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ガイアセイバー症候群の治療プロセス"], ["progress", 1], ["created_at", "2023-08-21 07:41:20.592356"], ["updated_at", "2023-08-21 07:41:20.592356"]]
---
    mission = Mission.new
    mission.title = response["title"]
    mission.progress = 1
    mission.save

INSERT INTO "sub_missions" ("mission_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["mission_id", 11], ["content", "症状の把握と診断"], ["created_at", "2023-08-21 07:41:20.706345"], ["updated_at", "2023-08-21 07:41:20.706345"]]
---
      sub = SubMission.new
      sub.mission = mission
      sub.content = res
      sub.save

SELECT "sub_missions".* FROM "sub_missions" WHERE "sub_missions"."mission_id" = ?  [["mission_id", 1]]
SELECT "missions".* FROM "missions"
---
  def all
    mission = Mission.all
    json_data = {}

    # DB1から目標情報を取得します。
    mission.each do |miso|
      goal_key = "goal#{miso.id}"
      json_data[goal_key] = { "title" => miso.title, "Progress" => {} }

      # DB2からサブミッション情報を取得します。
      sub = SubMission.where(mission_id: miso.id)
      sub.each do |submi|