back-end/app/controllers/api_controller.rb

INSERT INTO "missions" ("title", "progress", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "魔王を殺すプロセス"], ["progress", 1], ["created_at", "2023-08-22 18:02:35.948325"], ["updated_at", "2023-08-22 18:02:35.948325"]]
---
    mission = Mission.new
    mission.title = response["title"]
    mission.progress = 1
    mission.save

INSERT INTO "missions" ("title", "progress", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "勝利を達成するためのプロセス"], ["progress", 1], ["created_at", "2023-08-22 07:21:39.230643"], ["updated_at", "2023-08-22 07:21:39.230643"]]
---
      sub = SubMission.new
      sub.mission = mission
      sub.content = value
      sub.save

SELECT "missions".* FROM "missions"
SELECT "sub_missions".* FROM "sub_missions" WHERE "sub_missions"."mission_id" = ?  [["mission_id", 1]]
---
  def all
    mission = Mission.all
    json_data = {}

    # DB1から目標情報を取得します。
    mission.each do |miso|
      goal_key = "goal#{miso.id}"
      json_data[goal_key] = { "title" => miso.title, "Progress" => {} }

      # DB2からサブミッション情報を取得します。
      sub = SubMission.where(mission_id: miso.id)